zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/include/stm32h5xx_hal_play.h
/**
  ******************************************************************************
  * @file    stm32h5xx_hal_play.h
  * @brief   Header file of PLAY HAL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32H5xx_HAL_PLAY_H
#define STM32H5xx_HAL_PLAY_H

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/* Includes ------------------------------------------------------------------*/
#include "stm32h5xx_hal_def.h"

/** @addtogroup STM32H5xx_HAL_Driver
  * @{
  */

#if defined(PLAY1)
#include "stm32h5xx_ll_play.h"

/** @defgroup PLAY PLAY
  * @{
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup PLAY_Exported_Constants PLAY Exported Constants
  * @{
  */

/** @defgroup PLAY_Global_definition  PLAY Global definition
  * @{
  */

#define HAL_PLAY_LUT_INPUT_SOURCE_NBR         LL_PLAY_LUT_INPUT_SOURCE_NBR           /*!< Number of input sources per lookup table */
#define HAL_PLAY_LUT_TRUTH_TABLE_VALUE_MAX    (LL_PLAY_LUT_TRUTH_TABLE_VALUE_MAX)    /*!< Maximum Lookup table value               */
#define HAL_PLAY_INPUT_FILTER_WIDTH_VALUE_MAX (LL_PLAY_INPUT_FILTER_WIDTH_VALUE_MAX) /*!< Maximum pulse width value                */

/**
  * @}
  */

/** @defgroup PLAY_Error_Codes  PLAY Error Codes
  * @{
  */

#define HAL_PLAY_ERROR_NONE              (0U)         /*!< No error                              */
#define HAL_PLAY_ERROR_INVALID_PARAM     (1UL << 1U)  /*!< Invalid parameter                     */
#define HAL_PLAY_ERROR_INVALID_CALLBACK  (1UL << 2U)  /*!< Invalid Callback ID                   */
#if defined(GENERATOR_SECURITY_RIF_SUPPORTED)
#define HAL_PLAY_ERROR_MUTEX_LOCKED      (1UL << 5U)  /*!< PLAY Mutex taken by another instance  */
#define HAL_PLAY_ERROR_MUTEX_NOT_LOCKED  (1UL << 6U)  /*!< PLAY Mutex not taken                  */
#endif /* GENERATOR_SECURITY_RIF_SUPPORTED */

/**
  * @}
  */

/** @defgroup PLAY_Software_Trigger_ID  PLAY Software Trigger
  * @{
  */

#define HAL_PLAY_SWTRIG0    LL_PLAY_SWTRIG0    /*!< PLAY Software trigger 0        */
#define HAL_PLAY_SWTRIG1    LL_PLAY_SWTRIG1    /*!< PLAY Software trigger 1        */
#define HAL_PLAY_SWTRIG2    LL_PLAY_SWTRIG2    /*!< PLAY Software trigger 2        */
#define HAL_PLAY_SWTRIG3    LL_PLAY_SWTRIG3    /*!< PLAY Software trigger 3        */
#define HAL_PLAY_SWTRIG4    LL_PLAY_SWTRIG4    /*!< PLAY Software trigger 4        */
#define HAL_PLAY_SWTRIG5    LL_PLAY_SWTRIG5    /*!< PLAY Software trigger 5        */
#define HAL_PLAY_SWTRIG6    LL_PLAY_SWTRIG6    /*!< PLAY Software trigger 6        */
#define HAL_PLAY_SWTRIG7    LL_PLAY_SWTRIG7    /*!< PLAY Software trigger 7        */
#define HAL_PLAY_SWTRIG8    LL_PLAY_SWTRIG8    /*!< PLAY Software trigger 8        */
#define HAL_PLAY_SWTRIG9    LL_PLAY_SWTRIG9    /*!< PLAY Software trigger 9        */
#define HAL_PLAY_SWTRIG10   LL_PLAY_SWTRIG10   /*!< PLAY Software trigger 10       */
#define HAL_PLAY_SWTRIG11   LL_PLAY_SWTRIG11   /*!< PLAY Software trigger 11       */
#define HAL_PLAY_SWTRIG12   LL_PLAY_SWTRIG12   /*!< PLAY Software trigger 12       */
#define HAL_PLAY_SWTRIG13   LL_PLAY_SWTRIG13   /*!< PLAY Software trigger 13       */
#define HAL_PLAY_SWTRIG14   LL_PLAY_SWTRIG14   /*!< PLAY Software trigger 14       */
#define HAL_PLAY_SWTRIG15   LL_PLAY_SWTRIG15   /*!< PLAY Software trigger 15       */
#define HAL_PLAY_SWTRIG_ALL LL_PLAY_SWTRIG_ALL /*!< PLAY Software triggers 0 to 15 */

/**
  * @}
  */

/** @defgroup PLAY_LookUp_Table_Output  PLAY Lookup table Output Reference
  * @{
  */

#define HAL_PLAY_LUT0_OUT_DIRECT        LL_PLAY_LUT0_OUT_DIRECT        /*!< PLAY direct output of LUT 0             */
#define HAL_PLAY_LUT1_OUT_DIRECT        LL_PLAY_LUT1_OUT_DIRECT        /*!< PLAY direct output of LUT 1             */
#define HAL_PLAY_LUT2_OUT_DIRECT        LL_PLAY_LUT2_OUT_DIRECT        /*!< PLAY direct output of LUT 2             */
#define HAL_PLAY_LUT3_OUT_DIRECT        LL_PLAY_LUT3_OUT_DIRECT        /*!< PLAY direct output of LUT 3             */
#define HAL_PLAY_LUT4_OUT_DIRECT        LL_PLAY_LUT4_OUT_DIRECT        /*!< PLAY direct output of LUT 4             */
#define HAL_PLAY_LUT5_OUT_DIRECT        LL_PLAY_LUT5_OUT_DIRECT        /*!< PLAY direct output of LUT 5             */
#define HAL_PLAY_LUT6_OUT_DIRECT        LL_PLAY_LUT6_OUT_DIRECT        /*!< PLAY direct output of LUT 6             */
#define HAL_PLAY_LUT7_OUT_DIRECT        LL_PLAY_LUT7_OUT_DIRECT        /*!< PLAY direct output of LUT 7             */
#define HAL_PLAY_LUT8_OUT_DIRECT        LL_PLAY_LUT8_OUT_DIRECT        /*!< PLAY direct output of LUT 8             */
#define HAL_PLAY_LUT9_OUT_DIRECT        LL_PLAY_LUT9_OUT_DIRECT        /*!< PLAY direct output of LUT 9             */
#define HAL_PLAY_LUT10_OUT_DIRECT       LL_PLAY_LUT10_OUT_DIRECT       /*!< PLAY direct output of LUT 10            */
#define HAL_PLAY_LUT11_OUT_DIRECT       LL_PLAY_LUT11_OUT_DIRECT       /*!< PLAY direct output of LUT 11            */
#define HAL_PLAY_LUT12_OUT_DIRECT       LL_PLAY_LUT12_OUT_DIRECT       /*!< PLAY direct output of LUT 12            */
#define HAL_PLAY_LUT13_OUT_DIRECT       LL_PLAY_LUT13_OUT_DIRECT       /*!< PLAY direct output of LUT 13            */
#define HAL_PLAY_LUT14_OUT_DIRECT       LL_PLAY_LUT14_OUT_DIRECT       /*!< PLAY direct output of LUT 14            */
#define HAL_PLAY_LUT15_OUT_DIRECT       LL_PLAY_LUT15_OUT_DIRECT       /*!< PLAY direct output of LUT 15            */
#define HAL_PLAY_LUT_ALL_OUT_DIRECT     LL_PLAY_LUT_ALL_OUT_DIRECT     /*!< PLAY direct outputs of LUTs 0 to 15     */

#define HAL_PLAY_LUT0_OUT_REGISTERED    LL_PLAY_LUT0_OUT_REGISTERED    /*!< PLAY registered output of LUT 0         */
#define HAL_PLAY_LUT1_OUT_REGISTERED    LL_PLAY_LUT1_OUT_REGISTERED    /*!< PLAY registered output of LUT 1         */
#define HAL_PLAY_LUT2_OUT_REGISTERED    LL_PLAY_LUT2_OUT_REGISTERED    /*!< PLAY registered output of LUT 2         */
#define HAL_PLAY_LUT3_OUT_REGISTERED    LL_PLAY_LUT3_OUT_REGISTERED    /*!< PLAY registered output of LUT 3         */
#define HAL_PLAY_LUT4_OUT_REGISTERED    LL_PLAY_LUT4_OUT_REGISTERED    /*!< PLAY registered output of LUT 4         */
#define HAL_PLAY_LUT5_OUT_REGISTERED    LL_PLAY_LUT5_OUT_REGISTERED    /*!< PLAY registered output of LUT 5         */
#define HAL_PLAY_LUT6_OUT_REGISTERED    LL_PLAY_LUT6_OUT_REGISTERED    /*!< PLAY registered output of LUT 6         */
#define HAL_PLAY_LUT7_OUT_REGISTERED    LL_PLAY_LUT7_OUT_REGISTERED    /*!< PLAY registered output of LUT 7         */
#define HAL_PLAY_LUT8_OUT_REGISTERED    LL_PLAY_LUT8_OUT_REGISTERED    /*!< PLAY registered output of LUT 8         */
#define HAL_PLAY_LUT9_OUT_REGISTERED    LL_PLAY_LUT9_OUT_REGISTERED    /*!< PLAY registered output of LUT 9         */
#define HAL_PLAY_LUT10_OUT_REGISTERED   LL_PLAY_LUT10_OUT_REGISTERED   /*!< PLAY registered output of LUT 10        */
#define HAL_PLAY_LUT11_OUT_REGISTERED   LL_PLAY_LUT11_OUT_REGISTERED   /*!< PLAY registered output of LUT 11        */
#define HAL_PLAY_LUT12_OUT_REGISTERED   LL_PLAY_LUT12_OUT_REGISTERED   /*!< PLAY registered output of LUT 12        */
#define HAL_PLAY_LUT13_OUT_REGISTERED   LL_PLAY_LUT13_OUT_REGISTERED   /*!< PLAY registered output of LUT 13        */
#define HAL_PLAY_LUT14_OUT_REGISTERED   LL_PLAY_LUT14_OUT_REGISTERED   /*!< PLAY registered output of LUT 14        */
#define HAL_PLAY_LUT15_OUT_REGISTERED   LL_PLAY_LUT15_OUT_REGISTERED   /*!< PLAY registered output of LUT 15        */
#define HAL_PLAY_LUT_ALL_OUT_REGISTERED LL_PLAY_LUT_ALL_OUT_REGISTERED /*!< PLAY registered outputs of LUTs 0 to 15 */

/**
  * @}
  */

/** @defgroup PLAY_Interco_Matrix_definition  PLAY Interco Matrix definition
  * Definitions used to encode/decode the @ref HAL_PLAY_IN_SourceTypeDef enumerated values
  * @{
  */

#define HAL_PLAY_INSTANCE_ID_POS (29U) /*!< Instance number field position          */
#define HAL_PLAY_IN_MUX_POS      (6U)  /*!< Input Multiplexer number field position */

#define HAL_PLAY1_INSTANCE_ID    (0x1UL << HAL_PLAY_INSTANCE_ID_POS) /*!< Value of PLAY1 in enum value */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/* Exported types ------------------------------------------------------------*/
/** @defgroup PLAY_Exported_Types  PLAY Exported Types
  * @{
  */

/** @defgroup PLAY_Exported_Types_Group1  PLAY Global Enumerations
  * @{
  */

/**
  * @brief  PLAY Polling Mode on Lookup Table Output Edge Trigger enumeration
  */
typedef enum
{
  HAL_PLAY_POLLING_FOR_ALL_EDGES, /*!< Polling for all edges */
  HAL_PLAY_POLLING_FOR_ANY_EDGE,  /*!< Polling for any edge  */
} HAL_PLAY_PollingEdgeTriggerTypeDef;

/**
  * @brief  PLAY Software Trigger State enumeration
  */
typedef enum
{
  HAL_PLAY_SW_TRIGGER_RESET = 0U,      /*!< Software Trigger Reset state */
  HAL_PLAY_SW_TRIGGER_SET   = 0xFFFFU, /*!< Software Trigger Set state   */
} HAL_PLAY_SWTriggerStateTypeDef;

/**
  * @}
  */

/** @defgroup PLAY_Exported_Types_Group2  PLAY Input Configuration Structure
  * @{
  */

/**
  * @brief  PLAY Input Multiplexer enumeration
  */
typedef enum
{
  HAL_PLAY_IN0  = LL_PLAY_IN0,  /*!< PLAY Input 0  */
  HAL_PLAY_IN1  = LL_PLAY_IN1,  /*!< PLAY Input 1  */
  HAL_PLAY_IN2  = LL_PLAY_IN2,  /*!< PLAY Input 2  */
  HAL_PLAY_IN3  = LL_PLAY_IN3,  /*!< PLAY Input 3  */
  HAL_PLAY_IN4  = LL_PLAY_IN4,  /*!< PLAY Input 4  */
  HAL_PLAY_IN5  = LL_PLAY_IN5,  /*!< PLAY Input 5  */
  HAL_PLAY_IN6  = LL_PLAY_IN6,  /*!< PLAY Input 6  */
  HAL_PLAY_IN7  = LL_PLAY_IN7,  /*!< PLAY Input 7  */
  HAL_PLAY_IN8  = LL_PLAY_IN8,  /*!< PLAY Input 8  */
  HAL_PLAY_IN9  = LL_PLAY_IN9,  /*!< PLAY Input 9  */
  HAL_PLAY_IN10 = LL_PLAY_IN10, /*!< PLAY Input 10 */
  HAL_PLAY_IN11 = LL_PLAY_IN11, /*!< PLAY Input 11 */
  HAL_PLAY_IN12 = LL_PLAY_IN12, /*!< PLAY Input 12 */
  HAL_PLAY_IN13 = LL_PLAY_IN13, /*!< PLAY Input 13 */
  HAL_PLAY_IN14 = LL_PLAY_IN14, /*!< PLAY Input 14 */
  HAL_PLAY_IN15 = LL_PLAY_IN15, /*!< PLAY Input 15 */
} HAL_PLAY_INTypeDef;

/**
  * @brief  PLAY Input Multiplexer Edge Detection Mode enumeration
  */
typedef enum
{
  HAL_PLAY_EDGE_DETECTION_BYPASSED       = LL_PLAY_EDGE_DETECTION_MODE_BYPASSED,       /*!< Bypass mode                       */
  HAL_PLAY_EDGE_DETECTION_RISING         = LL_PLAY_EDGE_DETECTION_MODE_RISING,         /*!< Rising edge detection             */
  HAL_PLAY_EDGE_DETECTION_FALLING        = LL_PLAY_EDGE_DETECTION_MODE_FALLING,        /*!< Falling edge detection            */
  HAL_PLAY_EDGE_DETECTION_RISING_FALLING = LL_PLAY_EDGE_DETECTION_MODE_RISING_FALLING, /*!< Rising and falling edge detection */
} HAL_PLAY_EdgeDetectionModeTypeDef;

/**
  * @brief  PLAY Input Multiplexer Source enumeration
  */
typedef enum
{
  /* IO */
  HAL_PLAY1_IN_IN0_MUX0   = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN0  << HAL_PLAY_IN_MUX_POS) | 0U),
  HAL_PLAY1_IN_IN1_MUX1   = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN1  << HAL_PLAY_IN_MUX_POS) | 0U),
  HAL_PLAY1_IN_IN2_MUX2   = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN2  << HAL_PLAY_IN_MUX_POS) | 0U),
  HAL_PLAY1_IN_IN3_MUX3   = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN3  << HAL_PLAY_IN_MUX_POS) | 0U),
  HAL_PLAY1_IN_IN4_MUX4   = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN4  << HAL_PLAY_IN_MUX_POS) | 0U),
  HAL_PLAY1_IN_IN5_MUX5   = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN5  << HAL_PLAY_IN_MUX_POS) | 0U),
  HAL_PLAY1_IN_IN6_MUX6   = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN6  << HAL_PLAY_IN_MUX_POS) | 0U),
  HAL_PLAY1_IN_IN7_MUX7   = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN7  << HAL_PLAY_IN_MUX_POS) | 0U),
  HAL_PLAY1_IN_IN8_MUX8   = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN8  << HAL_PLAY_IN_MUX_POS) | 0U),
  HAL_PLAY1_IN_IN9_MUX9   = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN9  << HAL_PLAY_IN_MUX_POS) | 0U),
  HAL_PLAY1_IN_IN10_MUX10 = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN10 << HAL_PLAY_IN_MUX_POS) | 0U),
  HAL_PLAY1_IN_IN11_MUX11 = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN11 << HAL_PLAY_IN_MUX_POS) | 0U),
  HAL_PLAY1_IN_IN12_MUX12 = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN12 << HAL_PLAY_IN_MUX_POS) | 0U),
  HAL_PLAY1_IN_IN13_MUX13 = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN13 << HAL_PLAY_IN_MUX_POS) | 0U),
  HAL_PLAY1_IN_IN14_MUX14 = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN14 << HAL_PLAY_IN_MUX_POS) | 0U),
  HAL_PLAY1_IN_IN15_MUX15 = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN15 << HAL_PLAY_IN_MUX_POS) | 0U),

