zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/include/stm32h5xx_hal_play.h
  /* ADC */
  HAL_PLAY1_IN_ADC1_AWD1_MUX3  = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN3  << HAL_PLAY_IN_MUX_POS) | 7U),
  HAL_PLAY1_IN_ADC1_AWD1_MUX7  = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN7  << HAL_PLAY_IN_MUX_POS) | 1U),
  HAL_PLAY1_IN_ADC1_AWD1_MUX9  = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN9  << HAL_PLAY_IN_MUX_POS) | 3U),
  HAL_PLAY1_IN_ADC1_AWD1_MUX15 = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN15 << HAL_PLAY_IN_MUX_POS) | 5U),
  HAL_PLAY1_IN_ADC1_AWD2_MUX0  = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN0  << HAL_PLAY_IN_MUX_POS) | 5U),
  HAL_PLAY1_IN_ADC1_AWD2_MUX4  = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN4  << HAL_PLAY_IN_MUX_POS) | 7U),
  HAL_PLAY1_IN_ADC1_AWD2_MUX8  = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN8  << HAL_PLAY_IN_MUX_POS) | 1U),
  HAL_PLAY1_IN_ADC1_AWD2_MUX10 = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN10 << HAL_PLAY_IN_MUX_POS) | 3U),
  HAL_PLAY1_IN_ADC2_AWD1_MUX3  = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN3  << HAL_PLAY_IN_MUX_POS) | 6U),
  HAL_PLAY1_IN_ADC2_AWD1_MUX7  = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN7  << HAL_PLAY_IN_MUX_POS) | 2U),
  HAL_PLAY1_IN_ADC2_AWD1_MUX11 = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN11 << HAL_PLAY_IN_MUX_POS) | 4U),
  HAL_PLAY1_IN_ADC2_AWD2_MUX4  = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN4  << HAL_PLAY_IN_MUX_POS) | 6U),
  HAL_PLAY1_IN_ADC2_AWD2_MUX8  = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN8  << HAL_PLAY_IN_MUX_POS) | 2U),
  HAL_PLAY1_IN_ADC2_AWD2_MUX12 = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN12 << HAL_PLAY_IN_MUX_POS) | 4U),

  /* COMP */
  HAL_PLAY1_IN_COMP1_OUT_MUX1  = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN1  << HAL_PLAY_IN_MUX_POS) | 7U),
  HAL_PLAY1_IN_COMP1_OUT_MUX5  = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN5  << HAL_PLAY_IN_MUX_POS) | 1U),
  HAL_PLAY1_IN_COMP1_OUT_MUX7  = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN7  << HAL_PLAY_IN_MUX_POS) | 3U),
  HAL_PLAY1_IN_COMP1_OUT_MUX13 = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN13 << HAL_PLAY_IN_MUX_POS) | 5U),
  HAL_PLAY1_IN_COMP2_OUT_MUX1  = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN1  << HAL_PLAY_IN_MUX_POS) | 6U),
  HAL_PLAY1_IN_COMP2_OUT_MUX5  = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN5  << HAL_PLAY_IN_MUX_POS) | 2U),
  HAL_PLAY1_IN_COMP2_OUT_MUX9  = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN9  << HAL_PLAY_IN_MUX_POS) | 4U),

  /* EVENT_OUT */
  HAL_PLAY1_IN_EVENTOUT_MUX0   = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN0  << HAL_PLAY_IN_MUX_POS) | 4U),
  HAL_PLAY1_IN_EVENTOUT_MUX8   = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN8  << HAL_PLAY_IN_MUX_POS) | 6U),
  HAL_PLAY1_IN_EVENTOUT_MUX12  = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN12 << HAL_PLAY_IN_MUX_POS) | 2U),

  /* LOCKUP */
  HAL_PLAY1_IN_LOCKUP_MUX4     = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN4  << HAL_PLAY_IN_MUX_POS) | 5U),
  HAL_PLAY1_IN_LOCKUP_MUX8     = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN8  << HAL_PLAY_IN_MUX_POS) | 7U),
  HAL_PLAY1_IN_LOCKUP_MUX12    = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN12 << HAL_PLAY_IN_MUX_POS) | 1U),
  HAL_PLAY1_IN_LOCKUP_MUX14    = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN14 << HAL_PLAY_IN_MUX_POS) | 3U),

  /* LPTIM */
  HAL_PLAY1_IN_LPTIM1_CH1_MUX3  = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN3  << HAL_PLAY_IN_MUX_POS) | 1U),
  HAL_PLAY1_IN_LPTIM1_CH1_MUX5  = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN5  << HAL_PLAY_IN_MUX_POS) | 3U),
  HAL_PLAY1_IN_LPTIM1_CH1_MUX11 = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN11 << HAL_PLAY_IN_MUX_POS) | 5U),
  HAL_PLAY1_IN_LPTIM1_CH1_MUX15 = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN15 << HAL_PLAY_IN_MUX_POS) | 7U),
  HAL_PLAY1_IN_LPTIM1_CH2_MUX0  = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN0  << HAL_PLAY_IN_MUX_POS) | 7U),
  HAL_PLAY1_IN_LPTIM1_CH2_MUX4  = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN4  << HAL_PLAY_IN_MUX_POS) | 1U),
  HAL_PLAY1_IN_LPTIM1_CH2_MUX6  = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN6  << HAL_PLAY_IN_MUX_POS) | 3U),
  HAL_PLAY1_IN_LPTIM1_CH2_MUX12 = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN12 << HAL_PLAY_IN_MUX_POS) | 5U),
  HAL_PLAY1_IN_LPTIM2_CH1_MUX3  = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN3  << HAL_PLAY_IN_MUX_POS) | 2U),
  HAL_PLAY1_IN_LPTIM2_CH1_MUX7  = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN7  << HAL_PLAY_IN_MUX_POS) | 4U),
  HAL_PLAY1_IN_LPTIM2_CH1_MUX15 = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN15 << HAL_PLAY_IN_MUX_POS) | 6U),
  HAL_PLAY1_IN_LPTIM2_CH2_MUX0  = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN0  << HAL_PLAY_IN_MUX_POS) | 6U),
  HAL_PLAY1_IN_LPTIM2_CH2_MUX4  = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN4  << HAL_PLAY_IN_MUX_POS) | 2U),
  HAL_PLAY1_IN_LPTIM2_CH2_MUX8  = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN8  << HAL_PLAY_IN_MUX_POS) | 4U),

  /* MCO */
  HAL_PLAY1_IN_RCC_MCO1_MUX2    = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN2  << HAL_PLAY_IN_MUX_POS) | 7U),
  HAL_PLAY1_IN_RCC_MCO1_MUX6    = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN6  << HAL_PLAY_IN_MUX_POS) | 1U),
  HAL_PLAY1_IN_RCC_MCO1_MUX8    = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN8  << HAL_PLAY_IN_MUX_POS) | 3U),
  HAL_PLAY1_IN_RCC_MCO1_MUX14   = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN14 << HAL_PLAY_IN_MUX_POS) | 5U),
  HAL_PLAY1_IN_RCC_MCO2_MUX2    = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN2  << HAL_PLAY_IN_MUX_POS) | 6U),
  HAL_PLAY1_IN_RCC_MCO2_MUX6    = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN6  << HAL_PLAY_IN_MUX_POS) | 2U),
  HAL_PLAY1_IN_RCC_MCO2_MUX10   = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN10 << HAL_PLAY_IN_MUX_POS) | 4U),

  /* NMI */
  HAL_PLAY1_IN_NMI_MUX3         = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN3  << HAL_PLAY_IN_MUX_POS) | 5U),
  HAL_PLAY1_IN_NMI_MUX7         = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN7  << HAL_PLAY_IN_MUX_POS) | 7U),
  HAL_PLAY1_IN_NMI_MUX11        = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN11 << HAL_PLAY_IN_MUX_POS) | 1U),
  HAL_PLAY1_IN_NMI_MUX13        = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN13 << HAL_PLAY_IN_MUX_POS) | 3U),

  /* SPI */
  HAL_PLAY1_IN_SPI1_MOSI_MUX0  = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN0  << HAL_PLAY_IN_MUX_POS) | 3U),
  HAL_PLAY1_IN_SPI1_MOSI_MUX6  = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN6  << HAL_PLAY_IN_MUX_POS) | 5U),
  HAL_PLAY1_IN_SPI1_MOSI_MUX10 = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN10 << HAL_PLAY_IN_MUX_POS) | 7U),
  HAL_PLAY1_IN_SPI1_MOSI_MUX14 = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN14 << HAL_PLAY_IN_MUX_POS) | 1U),
  HAL_PLAY1_IN_SPI1_NSS_MUX5   = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN5  << HAL_PLAY_IN_MUX_POS) | 5U),
  HAL_PLAY1_IN_SPI1_NSS_MUX9   = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN9  << HAL_PLAY_IN_MUX_POS) | 7U),
  HAL_PLAY1_IN_SPI1_NSS_MUX13  = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN13 << HAL_PLAY_IN_MUX_POS) | 1U),
  HAL_PLAY1_IN_SPI1_NSS_MUX15  = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN15 << HAL_PLAY_IN_MUX_POS) | 3U),
  HAL_PLAY1_IN_SPI1_SCLK_MUX1  = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN1  << HAL_PLAY_IN_MUX_POS) | 3U),
  HAL_PLAY1_IN_SPI1_SCLK_MUX7  = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN7  << HAL_PLAY_IN_MUX_POS) | 5U),
  HAL_PLAY1_IN_SPI1_SCLK_MUX11 = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN11 << HAL_PLAY_IN_MUX_POS) | 7U),
  HAL_PLAY1_IN_SPI1_SCLK_MUX15 = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN15 << HAL_PLAY_IN_MUX_POS) | 1U),
  HAL_PLAY1_IN_SPI2_MOSI_MUX2  = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN2  << HAL_PLAY_IN_MUX_POS) | 4U),
  HAL_PLAY1_IN_SPI2_MOSI_MUX10 = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN10 << HAL_PLAY_IN_MUX_POS) | 6U),
  HAL_PLAY1_IN_SPI2_MOSI_MUX14 = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN14 << HAL_PLAY_IN_MUX_POS) | 2U),
  HAL_PLAY1_IN_SPI2_NSS_MUX1   = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN1  << HAL_PLAY_IN_MUX_POS) | 4U),
  HAL_PLAY1_IN_SPI2_NSS_MUX9   = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN9  << HAL_PLAY_IN_MUX_POS) | 6U),
  HAL_PLAY1_IN_SPI2_NSS_MUX13  = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN13 << HAL_PLAY_IN_MUX_POS) | 2U),
  HAL_PLAY1_IN_SPI2_SCLK_MUX3  = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN3  << HAL_PLAY_IN_MUX_POS) | 4U),
  HAL_PLAY1_IN_SPI2_SCLK_MUX11 = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN11 << HAL_PLAY_IN_MUX_POS) | 6U),
  HAL_PLAY1_IN_SPI2_SCLK_MUX15 = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN15 << HAL_PLAY_IN_MUX_POS) | 2U),

  /* TIM */
  HAL_PLAY1_IN_TIM2_OC3_MUX1   = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN1  << HAL_PLAY_IN_MUX_POS) | 1U),
  HAL_PLAY1_IN_TIM2_OC3_MUX3   = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN3  << HAL_PLAY_IN_MUX_POS) | 3U),
  HAL_PLAY1_IN_TIM2_OC3_MUX9   = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN9  << HAL_PLAY_IN_MUX_POS) | 5U),
  HAL_PLAY1_IN_TIM2_OC3_MUX13  = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN13 << HAL_PLAY_IN_MUX_POS) | 7U),
  HAL_PLAY1_IN_TIM2_OC4_MUX2   = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN2  << HAL_PLAY_IN_MUX_POS) | 1U),
  HAL_PLAY1_IN_TIM2_OC4_MUX4   = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN4  << HAL_PLAY_IN_MUX_POS) | 3U),
  HAL_PLAY1_IN_TIM2_OC4_MUX10  = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN10 << HAL_PLAY_IN_MUX_POS) | 5U),
  HAL_PLAY1_IN_TIM2_OC4_MUX14  = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN14 << HAL_PLAY_IN_MUX_POS) | 7U),
  HAL_PLAY1_IN_TIM2_TRGO_MUX0  = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN0  << HAL_PLAY_IN_MUX_POS) | 1U),
  HAL_PLAY1_IN_TIM2_TRGO_MUX2  = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN2  << HAL_PLAY_IN_MUX_POS) | 3U),
  HAL_PLAY1_IN_TIM2_TRGO_MUX8  = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN8  << HAL_PLAY_IN_MUX_POS) | 5U),
  HAL_PLAY1_IN_TIM2_TRGO_MUX12 = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN12 << HAL_PLAY_IN_MUX_POS) | 7U),
  HAL_PLAY1_IN_TIM3_OC3_MUX1   = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN1  << HAL_PLAY_IN_MUX_POS) | 2U),
  HAL_PLAY1_IN_TIM3_OC3_MUX5   = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN5  << HAL_PLAY_IN_MUX_POS) | 4U),
  HAL_PLAY1_IN_TIM3_OC3_MUX13  = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN13 << HAL_PLAY_IN_MUX_POS) | 6U),
  HAL_PLAY1_IN_TIM3_OC4_MUX2   = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN2  << HAL_PLAY_IN_MUX_POS) | 2U),
  HAL_PLAY1_IN_TIM3_OC4_MUX6   = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN6  << HAL_PLAY_IN_MUX_POS) | 4U),
  HAL_PLAY1_IN_TIM3_OC4_MUX14  = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN14 << HAL_PLAY_IN_MUX_POS) | 6U),
  HAL_PLAY1_IN_TIM3_TRGO_MUX0  = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN0  << HAL_PLAY_IN_MUX_POS) | 2U),
  HAL_PLAY1_IN_TIM3_TRGO_MUX4  = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN4  << HAL_PLAY_IN_MUX_POS) | 4U),
  HAL_PLAY1_IN_TIM3_TRGO_MUX12 = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN12 << HAL_PLAY_IN_MUX_POS) | 6U),

  /* USART */
  HAL_PLAY1_IN_USART1_CK_MUX2  = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN2  << HAL_PLAY_IN_MUX_POS) | 5U),
  HAL_PLAY1_IN_USART1_CK_MUX6  = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN6  << HAL_PLAY_IN_MUX_POS) | 7U),
  HAL_PLAY1_IN_USART1_CK_MUX10 = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN10 << HAL_PLAY_IN_MUX_POS) | 1U),
  HAL_PLAY1_IN_USART1_CK_MUX12 = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN12 << HAL_PLAY_IN_MUX_POS) | 3U),
  HAL_PLAY1_IN_USART1_TX_MUX1  = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN1  << HAL_PLAY_IN_MUX_POS) | 5U),
  HAL_PLAY1_IN_USART1_TX_MUX5  = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN5  << HAL_PLAY_IN_MUX_POS) | 7U),
  HAL_PLAY1_IN_USART1_TX_MUX9  = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN9  << HAL_PLAY_IN_MUX_POS) | 1U),
  HAL_PLAY1_IN_USART1_TX_MUX11 = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN11 << HAL_PLAY_IN_MUX_POS) | 3U),
  HAL_PLAY1_IN_USART2_CK_MUX6  = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN6  << HAL_PLAY_IN_MUX_POS) | 6U),
  HAL_PLAY1_IN_USART2_CK_MUX10 = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN10 << HAL_PLAY_IN_MUX_POS) | 2U),
  HAL_PLAY1_IN_USART2_CK_MUX14 = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN14 << HAL_PLAY_IN_MUX_POS) | 4U),
  HAL_PLAY1_IN_USART2_TX_MUX5  = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN5  << HAL_PLAY_IN_MUX_POS) | 6U),
  HAL_PLAY1_IN_USART2_TX_MUX9  = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN9  << HAL_PLAY_IN_MUX_POS) | 2U),
  HAL_PLAY1_IN_USART2_TX_MUX13 = (HAL_PLAY1_INSTANCE_ID | (HAL_PLAY_IN13 << HAL_PLAY_IN_MUX_POS) | 4U),
  HAL_PLAY_IN_SOURCE_INVALID = 0U, /*!< Invalid value */
} HAL_PLAY_IN_SourceTypeDef;

/**
  * @brief  PLAY Input Multiplexer Configuration structure
  */
typedef struct
{
  uint32_t                          min_pulse_width; /*!< Minimum Pulse Width. Value in range 0x00 to 0xFF */
  HAL_PLAY_EdgeDetectionModeTypeDef mode;            /*!< Edge Detection Mode                              */
  HAL_PLAY_IN_SourceTypeDef         source;          /*!< Signal source (premuxsel)                        */
} HAL_PLAY_IN_ConfTypeDef;

/**
  * @}
  */

/** @defgroup PLAY_Exported_Types_Group3 PLAY Lookup table Configuration Structure
  * @{
  */

/**
  * @brief  PLAY Lookup table enumeration
  */
typedef enum
{
  HAL_PLAY_LUT0  = LL_PLAY_LUT0,  /*!< PLAY Lookup table 0  */
  HAL_PLAY_LUT1  = LL_PLAY_LUT1,  /*!< PLAY Lookup table 1  */
  HAL_PLAY_LUT2  = LL_PLAY_LUT2,  /*!< PLAY Lookup table 2  */
  HAL_PLAY_LUT3  = LL_PLAY_LUT3,  /*!< PLAY Lookup table 3  */
  HAL_PLAY_LUT4  = LL_PLAY_LUT4,  /*!< PLAY Lookup table 4  */
  HAL_PLAY_LUT5  = LL_PLAY_LUT5,  /*!< PLAY Lookup table 5  */
  HAL_PLAY_LUT6  = LL_PLAY_LUT6,  /*!< PLAY Lookup table 6  */
  HAL_PLAY_LUT7  = LL_PLAY_LUT7,  /*!< PLAY Lookup table 7  */
  HAL_PLAY_LUT8  = LL_PLAY_LUT8,  /*!< PLAY Lookup table 8  */
  HAL_PLAY_LUT9  = LL_PLAY_LUT9,  /*!< PLAY Lookup table 9  */
  HAL_PLAY_LUT10 = LL_PLAY_LUT10, /*!< PLAY Lookup table 10 */
  HAL_PLAY_LUT11 = LL_PLAY_LUT11, /*!< PLAY Lookup table 11 */
  HAL_PLAY_LUT12 = LL_PLAY_LUT12, /*!< PLAY Lookup table 12 */
  HAL_PLAY_LUT13 = LL_PLAY_LUT13, /*!< PLAY Lookup table 13 */
  HAL_PLAY_LUT14 = LL_PLAY_LUT14, /*!< PLAY Lookup table 14 */
  HAL_PLAY_LUT15 = LL_PLAY_LUT15, /*!< PLAY Lookup table 15 */
} HAL_PLAY_LUTTypeDef;

/**
  * @brief  PLAY Lookup table Input enumeration
  */
typedef enum
{
  HAL_PLAY_LUT_INPUT0 = LL_PLAY_LUT_INPUT0,  /*!< PLAY Lookup table input 0 */
  HAL_PLAY_LUT_INPUT1 = LL_PLAY_LUT_INPUT1,  /*!< PLAY Lookup table input 1 */
  HAL_PLAY_LUT_INPUT2 = LL_PLAY_LUT_INPUT2,  /*!< PLAY Lookup table input 2 */
  HAL_PLAY_LUT_INPUT3 = LL_PLAY_LUT_INPUT3,  /*!< PLAY Lookup table input 3 */
} HAL_PLAY_LUT_InputTypeDef;

/**
  * @brief  PLAY Lookup table Input Source enumeration
  */
typedef enum
{
  HAL_PLAY_LUT_INPUT_LUT0_OUT_DIRECT      = LL_PLAY_LUT_SOURCE_LUT0_OUT_DIRECT,      /*!< PLAY Lookup table 0 direct output selected as input source      */
  HAL_PLAY_LUT_INPUT_LUT1_OUT_DIRECT      = LL_PLAY_LUT_SOURCE_LUT1_OUT_DIRECT,      /*!< PLAY Lookup table 1 direct output selected as input source      */
  HAL_PLAY_LUT_INPUT_LUT2_OUT_DIRECT      = LL_PLAY_LUT_SOURCE_LUT2_OUT_DIRECT,      /*!< PLAY Lookup table 2 direct output selected as input source      */
  HAL_PLAY_LUT_INPUT_LUT3_OUT_DIRECT      = LL_PLAY_LUT_SOURCE_LUT3_OUT_DIRECT,      /*!< PLAY Lookup table 3 direct output selected as input source      */
  HAL_PLAY_LUT_INPUT_LUT4_OUT_DIRECT      = LL_PLAY_LUT_SOURCE_LUT4_OUT_DIRECT,      /*!< PLAY Lookup table 4 direct output selected as input source      */
  HAL_PLAY_LUT_INPUT_LUT5_OUT_DIRECT      = LL_PLAY_LUT_SOURCE_LUT5_OUT_DIRECT,      /*!< PLAY Lookup table 5 direct output selected as input source      */
  HAL_PLAY_LUT_INPUT_LUT6_OUT_DIRECT      = LL_PLAY_LUT_SOURCE_LUT6_OUT_DIRECT,      /*!< PLAY Lookup table 6 direct output selected as input source      */
  HAL_PLAY_LUT_INPUT_LUT7_OUT_DIRECT      = LL_PLAY_LUT_SOURCE_LUT7_OUT_DIRECT,      /*!< PLAY Lookup table 7 direct output selected as input source      */
  HAL_PLAY_LUT_INPUT_LUT8_OUT_DIRECT      = LL_PLAY_LUT_SOURCE_LUT8_OUT_DIRECT,      /*!< PLAY Lookup table 8 direct output selected as input source      */
  HAL_PLAY_LUT_INPUT_LUT9_OUT_DIRECT      = LL_PLAY_LUT_SOURCE_LUT9_OUT_DIRECT,      /*!< PLAY Lookup table 9 direct output selected as input source      */
  HAL_PLAY_LUT_INPUT_LUT10_OUT_DIRECT     = LL_PLAY_LUT_SOURCE_LUT10_OUT_DIRECT,     /*!< PLAY Lookup table 10 direct output selected as input source     */
  HAL_PLAY_LUT_INPUT_LUT11_OUT_DIRECT     = LL_PLAY_LUT_SOURCE_LUT11_OUT_DIRECT,     /*!< PLAY Lookup table 11 direct output selected as input source     */
  HAL_PLAY_LUT_INPUT_LUT12_OUT_DIRECT     = LL_PLAY_LUT_SOURCE_LUT12_OUT_DIRECT,     /*!< PLAY Lookup table 12 direct output selected as input source     */
  HAL_PLAY_LUT_INPUT_LUT13_OUT_DIRECT     = LL_PLAY_LUT_SOURCE_LUT13_OUT_DIRECT,     /*!< PLAY Lookup table 13 direct output selected as input source     */
  HAL_PLAY_LUT_INPUT_LUT14_OUT_DIRECT     = LL_PLAY_LUT_SOURCE_LUT14_OUT_DIRECT,     /*!< PLAY Lookup table 14 direct output selected as input source     */
  HAL_PLAY_LUT_INPUT_LUT15_OUT_DIRECT     = LL_PLAY_LUT_SOURCE_LUT15_OUT_DIRECT,     /*!< PLAY Lookup table 15 direct output selected as input source     */

