zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/include/stm32h5xx_hal_play.h
  HAL_PLAY_LUT_INPUT_LUT0_OUT_REGISTERED  = LL_PLAY_LUT_SOURCE_LUT0_OUT_REGISTERED,  /*!< PLAY Lookup table 0 registered output selected as input source  */
  HAL_PLAY_LUT_INPUT_LUT1_OUT_REGISTERED  = LL_PLAY_LUT_SOURCE_LUT1_OUT_REGISTERED,  /*!< PLAY Lookup table 1 registered output selected as input source  */
  HAL_PLAY_LUT_INPUT_LUT2_OUT_REGISTERED  = LL_PLAY_LUT_SOURCE_LUT2_OUT_REGISTERED,  /*!< PLAY Lookup table 2 registered output selected as input source  */
  HAL_PLAY_LUT_INPUT_LUT3_OUT_REGISTERED  = LL_PLAY_LUT_SOURCE_LUT3_OUT_REGISTERED,  /*!< PLAY Lookup table 3 registered output selected as input source  */
  HAL_PLAY_LUT_INPUT_LUT4_OUT_REGISTERED  = LL_PLAY_LUT_SOURCE_LUT4_OUT_REGISTERED,  /*!< PLAY Lookup table 4 registered output selected as input source  */
  HAL_PLAY_LUT_INPUT_LUT5_OUT_REGISTERED  = LL_PLAY_LUT_SOURCE_LUT5_OUT_REGISTERED,  /*!< PLAY Lookup table 5 registered output selected as input source  */
  HAL_PLAY_LUT_INPUT_LUT6_OUT_REGISTERED  = LL_PLAY_LUT_SOURCE_LUT6_OUT_REGISTERED,  /*!< PLAY Lookup table 6 registered output selected as input source  */
  HAL_PLAY_LUT_INPUT_LUT7_OUT_REGISTERED  = LL_PLAY_LUT_SOURCE_LUT7_OUT_REGISTERED,  /*!< PLAY Lookup table 7 registered output selected as input source  */
  HAL_PLAY_LUT_INPUT_LUT8_OUT_REGISTERED  = LL_PLAY_LUT_SOURCE_LUT8_OUT_REGISTERED,  /*!< PLAY Lookup table 8 registered output selected as input source  */
  HAL_PLAY_LUT_INPUT_LUT9_OUT_REGISTERED  = LL_PLAY_LUT_SOURCE_LUT9_OUT_REGISTERED,  /*!< PLAY Lookup table 9 registered output selected as input source  */
  HAL_PLAY_LUT_INPUT_LUT10_OUT_REGISTERED = LL_PLAY_LUT_SOURCE_LUT10_OUT_REGISTERED, /*!< PLAY Lookup table 10 registered output selected as input source */
  HAL_PLAY_LUT_INPUT_LUT11_OUT_REGISTERED = LL_PLAY_LUT_SOURCE_LUT11_OUT_REGISTERED, /*!< PLAY Lookup table 11 registered output selected as input source */
  HAL_PLAY_LUT_INPUT_LUT12_OUT_REGISTERED = LL_PLAY_LUT_SOURCE_LUT12_OUT_REGISTERED, /*!< PLAY Lookup table 12 registered output selected as input source */
  HAL_PLAY_LUT_INPUT_LUT13_OUT_REGISTERED = LL_PLAY_LUT_SOURCE_LUT13_OUT_REGISTERED, /*!< PLAY Lookup table 13 registered output selected as input source */
  HAL_PLAY_LUT_INPUT_LUT14_OUT_REGISTERED = LL_PLAY_LUT_SOURCE_LUT14_OUT_REGISTERED, /*!< PLAY Lookup table 14 registered output selected as input source */
  HAL_PLAY_LUT_INPUT_LUT15_OUT_REGISTERED = LL_PLAY_LUT_SOURCE_LUT15_OUT_REGISTERED, /*!< PLAY Lookup table 15 registered output selected as input source */

  HAL_PLAY_LUT_INPUT_FILTER0              = LL_PLAY_LUT_SOURCE_FILTER0,              /*!< PLAY input signal IN0 selected as input source                  */
  HAL_PLAY_LUT_INPUT_FILTER1              = LL_PLAY_LUT_SOURCE_FILTER1,              /*!< PLAY input signal IN1 selected as input source                  */
  HAL_PLAY_LUT_INPUT_FILTER2              = LL_PLAY_LUT_SOURCE_FILTER2,              /*!< PLAY input signal IN2 selected as input source                  */
  HAL_PLAY_LUT_INPUT_FILTER3              = LL_PLAY_LUT_SOURCE_FILTER3,              /*!< PLAY input signal IN3 selected as input source                  */
  HAL_PLAY_LUT_INPUT_FILTER4              = LL_PLAY_LUT_SOURCE_FILTER4,              /*!< PLAY input signal IN4 selected as input source                  */
  HAL_PLAY_LUT_INPUT_FILTER5              = LL_PLAY_LUT_SOURCE_FILTER5,              /*!< PLAY input signal IN5 selected as input source                  */
  HAL_PLAY_LUT_INPUT_FILTER6              = LL_PLAY_LUT_SOURCE_FILTER6,              /*!< PLAY input signal IN6 selected as input source                  */
  HAL_PLAY_LUT_INPUT_FILTER7              = LL_PLAY_LUT_SOURCE_FILTER7,              /*!< PLAY input signal IN7 selected as input source                  */
  HAL_PLAY_LUT_INPUT_FILTER8              = LL_PLAY_LUT_SOURCE_FILTER8,              /*!< PLAY input signal IN8 selected as input source                  */
  HAL_PLAY_LUT_INPUT_FILTER9              = LL_PLAY_LUT_SOURCE_FILTER9,              /*!< PLAY input signal IN9 selected as input source                  */
  HAL_PLAY_LUT_INPUT_FILTER10             = LL_PLAY_LUT_SOURCE_FILTER10,             /*!< PLAY input signal IN10 selected as input source                 */
  HAL_PLAY_LUT_INPUT_FILTER11             = LL_PLAY_LUT_SOURCE_FILTER11,             /*!< PLAY input signal IN11 selected as input source                 */
  HAL_PLAY_LUT_INPUT_FILTER12             = LL_PLAY_LUT_SOURCE_FILTER12,             /*!< PLAY input signal IN12 selected as input source                 */
  HAL_PLAY_LUT_INPUT_FILTER13             = LL_PLAY_LUT_SOURCE_FILTER13,             /*!< PLAY input signal IN13 selected as input source                 */
  HAL_PLAY_LUT_INPUT_FILTER14             = LL_PLAY_LUT_SOURCE_FILTER14,             /*!< PLAY input signal IN14 selected as input source                 */
  HAL_PLAY_LUT_INPUT_FILTER15             = LL_PLAY_LUT_SOURCE_FILTER15,             /*!< PLAY input signal IN15 selected as input source                 */

  HAL_PLAY_LUT_INPUT_SWTRIG0              = LL_PLAY_LUT_SOURCE_SWTRIG0,              /*!< PLAY software trigger input 0 selected as input source          */
  HAL_PLAY_LUT_INPUT_SWTRIG1              = LL_PLAY_LUT_SOURCE_SWTRIG1,              /*!< PLAY software trigger input 1 selected as input source          */
  HAL_PLAY_LUT_INPUT_SWTRIG2              = LL_PLAY_LUT_SOURCE_SWTRIG2,              /*!< PLAY software trigger input 2 selected as input source          */
  HAL_PLAY_LUT_INPUT_SWTRIG3              = LL_PLAY_LUT_SOURCE_SWTRIG3,              /*!< PLAY software trigger input 3 selected as input source          */
  HAL_PLAY_LUT_INPUT_SWTRIG4              = LL_PLAY_LUT_SOURCE_SWTRIG4,              /*!< PLAY software trigger input 4 selected as input source          */
  HAL_PLAY_LUT_INPUT_SWTRIG5              = LL_PLAY_LUT_SOURCE_SWTRIG5,              /*!< PLAY software trigger input 5 selected as input source          */
  HAL_PLAY_LUT_INPUT_SWTRIG6              = LL_PLAY_LUT_SOURCE_SWTRIG6,              /*!< PLAY software trigger input 6 selected as input source          */
  HAL_PLAY_LUT_INPUT_SWTRIG7              = LL_PLAY_LUT_SOURCE_SWTRIG7,              /*!< PLAY software trigger input 7 selected as input source          */
  HAL_PLAY_LUT_INPUT_SWTRIG8              = LL_PLAY_LUT_SOURCE_SWTRIG8,              /*!< PLAY software trigger input 8 selected as input source          */
  HAL_PLAY_LUT_INPUT_SWTRIG9              = LL_PLAY_LUT_SOURCE_SWTRIG9,              /*!< PLAY software trigger input 9 selected as input source          */
  HAL_PLAY_LUT_INPUT_SWTRIG10             = LL_PLAY_LUT_SOURCE_SWTRIG10,             /*!< PLAY software trigger input 10 selected as input source         */
  HAL_PLAY_LUT_INPUT_SWTRIG11             = LL_PLAY_LUT_SOURCE_SWTRIG11,             /*!< PLAY software trigger input 11 selected as input source         */
  HAL_PLAY_LUT_INPUT_SWTRIG12             = LL_PLAY_LUT_SOURCE_SWTRIG12,             /*!< PLAY software trigger input 12 selected as input source         */
  HAL_PLAY_LUT_INPUT_SWTRIG13             = LL_PLAY_LUT_SOURCE_SWTRIG13,             /*!< PLAY software trigger input 13 selected as input source         */
  HAL_PLAY_LUT_INPUT_SWTRIG14             = LL_PLAY_LUT_SOURCE_SWTRIG14,             /*!< PLAY software trigger input 14 selected as input source         */
  HAL_PLAY_LUT_INPUT_SWTRIG15             = LL_PLAY_LUT_SOURCE_SWTRIG15,             /*!< PLAY software trigger input 15 selected as input source         */

