zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/include/stm32h5xx_hal_play.h
  HAL_PLAY_LUT_INPUT_DEFAULT              = LL_PLAY_LUT_SOURCE_SWTRIG15,             /*!< Default value                                                   */
} HAL_PLAY_LUT_InputSourceTypeDef;

/**
  * @brief  PLAY Lookup table Clock Gate Source enumeration
  */
typedef enum
{
  HAL_PLAY_LUT_CLK_GATE_OFF                  = LL_PLAY_LUT_CLK_GATE_OFF,                  /*!< PLAY LUT clock gate is OFF                            */
  HAL_PLAY_LUT_CLK_GATE_ON                   = LL_PLAY_LUT_CLK_GATE_ON,                   /*!< PLAY LUT clock gate is always enabled                 */
  HAL_PLAY_LUT_CLK_GATE_SW_ACK               = LL_PLAY_LUT_CLK_GATE_SW_ACK,               /*!< PLAY LUT clock gate source is SWIN_WE signal          */

  HAL_PLAY_LUT_CLK_GATE_LUT0_OUT_REGISTERED  = LL_PLAY_LUT_CLK_GATE_LUT0_OUT_REGISTERED,  /*!< PLAY LUT clock gate source is LUT0 registered output  */
  HAL_PLAY_LUT_CLK_GATE_LUT1_OUT_REGISTERED  = LL_PLAY_LUT_CLK_GATE_LUT1_OUT_REGISTERED,  /*!< PLAY LUT clock gate source is LUT1 registered output  */
  HAL_PLAY_LUT_CLK_GATE_LUT2_OUT_REGISTERED  = LL_PLAY_LUT_CLK_GATE_LUT2_OUT_REGISTERED,  /*!< PLAY LUT clock gate source is LUT2 registered output  */
  HAL_PLAY_LUT_CLK_GATE_LUT3_OUT_REGISTERED  = LL_PLAY_LUT_CLK_GATE_LUT3_OUT_REGISTERED,  /*!< PLAY LUT clock gate source is LUT3 registered output  */
  HAL_PLAY_LUT_CLK_GATE_LUT4_OUT_REGISTERED  = LL_PLAY_LUT_CLK_GATE_LUT4_OUT_REGISTERED,  /*!< PLAY LUT clock gate source is LUT4 registered output  */
  HAL_PLAY_LUT_CLK_GATE_LUT5_OUT_REGISTERED  = LL_PLAY_LUT_CLK_GATE_LUT5_OUT_REGISTERED,  /*!< PLAY LUT clock gate source is LUT5 registered output  */
  HAL_PLAY_LUT_CLK_GATE_LUT6_OUT_REGISTERED  = LL_PLAY_LUT_CLK_GATE_LUT6_OUT_REGISTERED,  /*!< PLAY LUT clock gate source is LUT6 registered output  */
  HAL_PLAY_LUT_CLK_GATE_LUT7_OUT_REGISTERED  = LL_PLAY_LUT_CLK_GATE_LUT7_OUT_REGISTERED,  /*!< PLAY LUT clock gate source is LUT7 registered output  */
  HAL_PLAY_LUT_CLK_GATE_LUT8_OUT_REGISTERED  = LL_PLAY_LUT_CLK_GATE_LUT8_OUT_REGISTERED,  /*!< PLAY LUT clock gate source is LUT8 registered output  */
  HAL_PLAY_LUT_CLK_GATE_LUT9_OUT_REGISTERED  = LL_PLAY_LUT_CLK_GATE_LUT9_OUT_REGISTERED,  /*!< PLAY LUT clock gate source is LUT9 registered output  */
  HAL_PLAY_LUT_CLK_GATE_LUT10_OUT_REGISTERED = LL_PLAY_LUT_CLK_GATE_LUT10_OUT_REGISTERED, /*!< PLAY LUT clock gate source is LUT10 registered output */
  HAL_PLAY_LUT_CLK_GATE_LUT11_OUT_REGISTERED = LL_PLAY_LUT_CLK_GATE_LUT11_OUT_REGISTERED, /*!< PLAY LUT clock gate source is LUT11 registered output */
  HAL_PLAY_LUT_CLK_GATE_LUT12_OUT_REGISTERED = LL_PLAY_LUT_CLK_GATE_LUT12_OUT_REGISTERED, /*!< PLAY LUT clock gate source is LUT12 registered output */
  HAL_PLAY_LUT_CLK_GATE_LUT13_OUT_REGISTERED = LL_PLAY_LUT_CLK_GATE_LUT13_OUT_REGISTERED, /*!< PLAY LUT clock gate source is LUT13 registered output */
  HAL_PLAY_LUT_CLK_GATE_LUT14_OUT_REGISTERED = LL_PLAY_LUT_CLK_GATE_LUT14_OUT_REGISTERED, /*!< PLAY LUT clock gate source is LUT14 registered output */
  HAL_PLAY_LUT_CLK_GATE_LUT15_OUT_REGISTERED = LL_PLAY_LUT_CLK_GATE_LUT15_OUT_REGISTERED, /*!< PLAY LUT clock gate source is LUT15 registered output */

  HAL_PLAY_LUT_CLK_GATE_FILTER0              = LL_PLAY_LUT_CLK_GATE_FILTER0,              /*!< PLAY LUT clock gate source is input signal IN0        */
  HAL_PLAY_LUT_CLK_GATE_FILTER1              = LL_PLAY_LUT_CLK_GATE_FILTER1,              /*!< PLAY LUT clock gate source is input signal IN1        */
  HAL_PLAY_LUT_CLK_GATE_FILTER2              = LL_PLAY_LUT_CLK_GATE_FILTER2,              /*!< PLAY LUT clock gate source is input signal IN2        */
  HAL_PLAY_LUT_CLK_GATE_FILTER3              = LL_PLAY_LUT_CLK_GATE_FILTER3,              /*!< PLAY LUT clock gate source is input signal IN3        */
  HAL_PLAY_LUT_CLK_GATE_FILTER4              = LL_PLAY_LUT_CLK_GATE_FILTER4,              /*!< PLAY LUT clock gate source is input signal IN4        */
  HAL_PLAY_LUT_CLK_GATE_FILTER5              = LL_PLAY_LUT_CLK_GATE_FILTER5,              /*!< PLAY LUT clock gate source is input signal IN5        */
  HAL_PLAY_LUT_CLK_GATE_FILTER6              = LL_PLAY_LUT_CLK_GATE_FILTER6,              /*!< PLAY LUT clock gate source is input signal IN6        */
  HAL_PLAY_LUT_CLK_GATE_FILTER7              = LL_PLAY_LUT_CLK_GATE_FILTER7,              /*!< PLAY LUT clock gate source is input signal IN7        */
  HAL_PLAY_LUT_CLK_GATE_FILTER8              = LL_PLAY_LUT_CLK_GATE_FILTER8,              /*!< PLAY LUT clock gate source is input signal IN8        */
  HAL_PLAY_LUT_CLK_GATE_FILTER9              = LL_PLAY_LUT_CLK_GATE_FILTER9,              /*!< PLAY LUT clock gate source is input signal IN9        */
  HAL_PLAY_LUT_CLK_GATE_FILTER10             = LL_PLAY_LUT_CLK_GATE_FILTER10,             /*!< PLAY LUT clock gate source is input signal IN10       */
  HAL_PLAY_LUT_CLK_GATE_FILTER11             = LL_PLAY_LUT_CLK_GATE_FILTER11,             /*!< PLAY LUT clock gate source is input signal IN11       */
  HAL_PLAY_LUT_CLK_GATE_FILTER12             = LL_PLAY_LUT_CLK_GATE_FILTER12,             /*!< PLAY LUT clock gate source is input signal IN12       */
  HAL_PLAY_LUT_CLK_GATE_FILTER13             = LL_PLAY_LUT_CLK_GATE_FILTER13,             /*!< PLAY LUT clock gate source is input signal IN13       */
  HAL_PLAY_LUT_CLK_GATE_FILTER14             = LL_PLAY_LUT_CLK_GATE_FILTER14,             /*!< PLAY LUT clock gate source is input signal IN14       */
  HAL_PLAY_LUT_CLK_GATE_FILTER15             = LL_PLAY_LUT_CLK_GATE_FILTER15,             /*!< PLAY LUT clock gate source is input signal IN15       */

  HAL_PLAY_LUT_CLK_GATE_SWTRIG0              = LL_PLAY_LUT_CLK_GATE_SWTRIG0,              /*!< PLAY LUT clock gate source is software trigger 0      */
  HAL_PLAY_LUT_CLK_GATE_SWTRIG1              = LL_PLAY_LUT_CLK_GATE_SWTRIG1,              /*!< PLAY LUT clock gate source is software trigger 1      */
  HAL_PLAY_LUT_CLK_GATE_SWTRIG2              = LL_PLAY_LUT_CLK_GATE_SWTRIG2,              /*!< PLAY LUT clock gate source is software trigger 2      */
  HAL_PLAY_LUT_CLK_GATE_SWTRIG3              = LL_PLAY_LUT_CLK_GATE_SWTRIG3,              /*!< PLAY LUT clock gate source is software trigger 3      */
  HAL_PLAY_LUT_CLK_GATE_SWTRIG4              = LL_PLAY_LUT_CLK_GATE_SWTRIG4,              /*!< PLAY LUT clock gate source is software trigger 4      */
  HAL_PLAY_LUT_CLK_GATE_SWTRIG5              = LL_PLAY_LUT_CLK_GATE_SWTRIG5,              /*!< PLAY LUT clock gate source is software trigger 5      */
  HAL_PLAY_LUT_CLK_GATE_SWTRIG6              = LL_PLAY_LUT_CLK_GATE_SWTRIG6,              /*!< PLAY LUT clock gate source is software trigger 6      */
  HAL_PLAY_LUT_CLK_GATE_SWTRIG7              = LL_PLAY_LUT_CLK_GATE_SWTRIG7,              /*!< PLAY LUT clock gate source is software trigger 7      */
  HAL_PLAY_LUT_CLK_GATE_SWTRIG8              = LL_PLAY_LUT_CLK_GATE_SWTRIG8,              /*!< PLAY LUT clock gate source is software trigger 8      */
  HAL_PLAY_LUT_CLK_GATE_SWTRIG9              = LL_PLAY_LUT_CLK_GATE_SWTRIG9,              /*!< PLAY LUT clock gate source is software trigger 9      */
  HAL_PLAY_LUT_CLK_GATE_SWTRIG10             = LL_PLAY_LUT_CLK_GATE_SWTRIG10,             /*!< PLAY LUT clock gate source is software trigger 10     */
  HAL_PLAY_LUT_CLK_GATE_SWTRIG11             = LL_PLAY_LUT_CLK_GATE_SWTRIG11,             /*!< PLAY LUT clock gate source is software trigger 11     */
  HAL_PLAY_LUT_CLK_GATE_SWTRIG12             = LL_PLAY_LUT_CLK_GATE_SWTRIG12,             /*!< PLAY LUT clock gate source is software trigger 12     */
  HAL_PLAY_LUT_CLK_GATE_SWTRIG13             = LL_PLAY_LUT_CLK_GATE_SWTRIG13,             /*!< PLAY LUT clock gate source is software trigger 13     */
  HAL_PLAY_LUT_CLK_GATE_SWTRIG14             = LL_PLAY_LUT_CLK_GATE_SWTRIG14,             /*!< PLAY LUT clock gate source is software trigger 14     */
  HAL_PLAY_LUT_CLK_GATE_SWTRIG15             = LL_PLAY_LUT_CLK_GATE_SWTRIG15,             /*!< PLAY LUT clock gate source is software trigger 15     */
} HAL_PLAY_LUT_ClkGateSourceTypeDef;

/**
  * @brief  PLAY Lookup table Configuration structure
  */
typedef struct
{
  HAL_PLAY_LUTTypeDef               lut;                                         /*!< Lookup table               */

