zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/include/stm32h5xx_hal_play.h
  uint32_t                          truth_table;                                 /*!< Truth table value          */
  HAL_PLAY_LUT_InputSourceTypeDef   input_source[HAL_PLAY_LUT_INPUT_SOURCE_NBR]; /*!< Lookup table input sources */
  HAL_PLAY_LUT_ClkGateSourceTypeDef clk_gate_source;                             /*!< Clock gate source          */
} HAL_PLAY_LUT_ConfTypeDef;

/**
  * @}
  */

/** @defgroup PLAY_Exported_Types_Group4 PLAY Output Multiplexer Configuration Structure
  * @{
  */

/**
  * @brief  PLAY Edge Trigger Configuration for Lookup Table Outputs
  */
typedef struct
{
  uint32_t lut_out_falling_mask; /*!< LUT Outputs mask to set in falling edge.
                                      Value can be a combination of @ref PLAY_LookUp_Table_Output */
  uint32_t lut_out_rising_mask;  /*!< LUT Outputs mask to set in rising edge.
                                      Value can be a combination of @ref PLAY_LookUp_Table_Output */
} HAL_PLAY_EdgeTriggerConfTypeDef;

/**
  * @brief  PLAY Output Multiplexer enumeration
  */
typedef enum
{
  HAL_PLAY_OUT0  = LL_PLAY_OUT0,  /*!< PLAY Output 0  */
  HAL_PLAY_OUT1  = LL_PLAY_OUT1,  /*!< PLAY Output 1  */
  HAL_PLAY_OUT2  = LL_PLAY_OUT2,  /*!< PLAY Output 2  */
  HAL_PLAY_OUT3  = LL_PLAY_OUT3,  /*!< PLAY Output 3  */
  HAL_PLAY_OUT4  = LL_PLAY_OUT4,  /*!< PLAY Output 4  */
  HAL_PLAY_OUT5  = LL_PLAY_OUT5,  /*!< PLAY Output 5  */
  HAL_PLAY_OUT6  = LL_PLAY_OUT6,  /*!< PLAY Output 6  */
  HAL_PLAY_OUT7  = LL_PLAY_OUT7,  /*!< PLAY Output 7  */
  HAL_PLAY_OUT8  = LL_PLAY_OUT8,  /*!< PLAY Output 8  */
  HAL_PLAY_OUT9  = LL_PLAY_OUT9,  /*!< PLAY Output 9  */
  HAL_PLAY_OUT10 = LL_PLAY_OUT10, /*!< PLAY Output 10 */
  HAL_PLAY_OUT11 = LL_PLAY_OUT11, /*!< PLAY Output 11 */
  HAL_PLAY_OUT12 = LL_PLAY_OUT12, /*!< PLAY Output 12 */
  HAL_PLAY_OUT13 = LL_PLAY_OUT13, /*!< PLAY Output 13 */
  HAL_PLAY_OUT14 = LL_PLAY_OUT14, /*!< PLAY Output 14 */
  HAL_PLAY_OUT15 = LL_PLAY_OUT15, /*!< PLAY Output 15 */
} HAL_PLAY_OUTTypeDef;

/**
  * @brief  PLAY Output Multiplexer Configuration
  */
typedef struct
{
  HAL_PLAY_OUTTypeDef output_mux; /*!< Output multiplexer                                        */
  uint32_t            lut_output; /*!< Lookup table output, one of @ref PLAY_LookUp_Table_Output */
} HAL_PLAY_OUT_ConfTypeDef;

/**
  * @}
  */

/**
  * @}
  */

/** @defgroup PLAY_Exported_Types_Group5  PLAY Handle
  * @{
  */

/**
  * @brief  PLAY HAL Handle State enumeration
  */
typedef enum
{
  HAL_PLAY_STATE_RESET = 0U,           /*!< PLAY not yet initialized                    */
  HAL_PLAY_STATE_INIT  = (1UL << 31U), /*!< PLAY initialized but not yet configured     */
  HAL_PLAY_STATE_READY = (1UL << 30U), /*!< PLAY initialized, configured but not locked */
  HAL_PLAY_STATE_BUSY  = (1UL << 29U), /*!< PLAY configured and locked                  */
} HAL_PLAY_StateTypeDef;

/**
  * @brief  PLAY Handle Structure definition
  */
#if (USE_HAL_PLAY_REGISTER_CALLBACKS == 1)
typedef struct __HAL_PLAY_HandleTypeDef
#else
typedef struct
#endif /* USE_HAL_PLAY_REGISTER_CALLBACKS */
{
  PLAY_TypeDef              *instance; /*!< Register base address  */

  __IO HAL_PLAY_StateTypeDef State;    /*!< PLAY peripheral state  */

  __IO uint32_t ErrorCode;             /*!< Errors codes of the peripheral.
                                            This parameter can be a combination of @ref PLAY_Error_Codes */

#if (USE_HAL_PLAY_REGISTER_CALLBACKS == 1)
  void (* SWTriggerWriteCpltCallback)(struct __HAL_PLAY_HandleTypeDef *hplay);
  void (* EdgeTriggerWriteCpltCallback)(struct __HAL_PLAY_HandleTypeDef *hplay);
  void (* LUTOutputRisingCallback)(struct __HAL_PLAY_HandleTypeDef *hplay, uint32_t mask_flags);
  void (* LUTOutputFallingCallback)(struct __HAL_PLAY_HandleTypeDef *hplay, uint32_t mask_flags);
  void (* MspInitCallback)(struct __HAL_PLAY_HandleTypeDef *hplay);
  void (* MspDeInitCallback)(struct __HAL_PLAY_HandleTypeDef *hplay);
#endif /* USE_HAL_PLAY_REGISTER_CALLBACKS */
} HAL_PLAY_HandleTypeDef;

#if (USE_HAL_PLAY_REGISTER_CALLBACKS == 1)
/**
  * @brief  PLAY callback ID enumeration definition
  */
typedef enum
{
  HAL_PLAY_SW_TRIGGER_WRITE_CPLT_CB_ID   = 0x00U, /*!< SW Trigger Write Complete callback ID   */
  HAL_PLAY_EDGE_TRIGGER_WRITE_CPLT_CB_ID = 0x01U, /*!< Edge Trigger Write Complete callback ID */
  HAL_PLAY_LUT_OUTPUT_RISING_CB_ID       = 0x02U, /*!< LUT Output Rising callback ID           */
  HAL_PLAY_LUT_OUTPUT_FALLING_CB_ID      = 0x03U, /*!< LUT Output Falling callback ID          */

  HAL_PLAY_MSPINIT_CB_ID                 = 0xFEU, /*!< MSP init callback ID                    */
  HAL_PLAY_MSPDEINIT_CB_ID               = 0xFFU, /*!< MSP de-init callback ID                 */
} HAL_PLAY_CallbackIDTypeDef;

/**
  * @brief  PLAY callback pointers definition
  */
typedef void (*pPLAY_CallbackTypeDef)(HAL_PLAY_HandleTypeDef *hplay); /*!< Pointer to a PLAY callback function */
typedef void (*pPLAY_LUTOutputCallbackTypeDef)(HAL_PLAY_HandleTypeDef *hplay, uint32_t mask_flags); /*!< Pointer to a PLAY LUT output callback function */

#endif /* USE_HAL_PLAY_REGISTER_CALLBACKS */

/**
  * @}
  */

/**
  * @}
  */

/** @defgroup PLAY_Attributes PLAY security/privilege attributes
  * @{
  */

/**
  * @brief Security access level attribute
  */
typedef enum
{
  HAL_PLAY_NSEC = LL_PLAY_ATTR_NSEC, /*!< Non-secure access level attribute */
  HAL_PLAY_SEC  = LL_PLAY_ATTR_SEC   /*!< Secure access level attribute     */
} HAL_PLAY_SecAttrTypeDef;

/**
  * @brief Privileged access level attribute
  */
typedef enum
{
  HAL_PLAY_NPRIV = LL_PLAY_ATTR_NPRIV, /*!< Non-privileged access level attribute */
  HAL_PLAY_PRIV  = LL_PLAY_ATTR_PRIV   /*!< Privileged access level attribute     */
} HAL_PLAY_PrivAttrTypeDef;

/**
  * @brief PLAY attributes configuration items
  */

#define HAL_PLAY_SEC_ITEM_CONFIG  LL_PLAY_SEC_ITEM_CONFIG  /*!< PLAY configuration registers items */
#define HAL_PLAY_SEC_ITEM_ALL     LL_PLAY_SEC_ITEM_ALL     /*!< All PLAY registers items           */

