zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/include/stm32h5xx_hal_play.h
#define HAL_PLAY_PRIV_ITEM_CONFIG LL_PLAY_PRIV_ITEM_CONFIG /*!< PLAY configuration registers items */
#define HAL_PLAY_PRIV_ITEM_ALL    LL_PLAY_PRIV_ITEM_ALL    /*!< All PLAY registers items           */

/**
  * @}
  */

/* Exported macros -----------------------------------------------------------*/
/** @defgroup PLAY_Exported_Macros PLAY Exported Macros
  * @{
  */

/** @brief Reset PLAY handle state.
  * @param  __HANDLE__  specifies the PLAY Handle.
  * @retval None
  */
#if (USE_HAL_PLAY_REGISTER_CALLBACKS == 1)
#define __HAL_PLAY_RESET_HANDLE_STATE(__HANDLE__)       \
  do {                                                  \
    (__HANDLE__)->State = HAL_PLAY_STATE_RESET;         \
    (__HANDLE__)->MspInitCallback = NULL;               \
    (__HANDLE__)->MspDeInitCallback = NULL;             \
  } while (0U)
#else
#define __HAL_PLAY_RESET_HANDLE_STATE(__HANDLE__)  ((__HANDLE__)->State = HAL_PLAY_STATE_RESET)
#endif /* USE_HAL_PLAY_REGISTER_CALLBACKS */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @defgroup PLAY_Exported_Functions PLAY Exported Functions
  * @{
  */

/** @defgroup PLAY_Exported_Functions_Group1  Initialization and de-initialization functions
  * @{
  */

HAL_StatusTypeDef HAL_PLAY_Init(HAL_PLAY_HandleTypeDef *hplay);
HAL_StatusTypeDef HAL_PLAY_DeInit(HAL_PLAY_HandleTypeDef *hplay);

void HAL_PLAY_MspInit(HAL_PLAY_HandleTypeDef *hplay);
void HAL_PLAY_MspDeInit(HAL_PLAY_HandleTypeDef *hplay);

/**
  * @}
  */

/** @defgroup PLAY_Exported_Functions_Group2  Configuration functions
  * @{
  */

/* PLAY Configuration functions ***********************************************/
HAL_StatusTypeDef HAL_PLAY_INPUT_SetConfig(HAL_PLAY_HandleTypeDef *hplay, const HAL_PLAY_IN_ConfTypeDef *p_config,
                                           uint32_t size_array);
HAL_StatusTypeDef HAL_PLAY_INPUT_GetConfig(HAL_PLAY_HandleTypeDef *hplay, HAL_PLAY_IN_ConfTypeDef *p_config,
                                           uint32_t size_array);

HAL_StatusTypeDef HAL_PLAY_LUT_SetConfig(HAL_PLAY_HandleTypeDef *hplay, const HAL_PLAY_LUT_ConfTypeDef *p_config,
                                         uint32_t size_array);
HAL_StatusTypeDef HAL_PLAY_LUT_GetConfig(HAL_PLAY_HandleTypeDef *hplay, HAL_PLAY_LUT_ConfTypeDef *p_config,
                                         uint32_t size_array);

HAL_StatusTypeDef HAL_PLAY_OUTPUT_SetConfig(HAL_PLAY_HandleTypeDef *hplay, const HAL_PLAY_OUT_ConfTypeDef *p_config,
                                            uint32_t size_array);
HAL_StatusTypeDef HAL_PLAY_OUTPUT_GetConfig(HAL_PLAY_HandleTypeDef *hplay, HAL_PLAY_OUT_ConfTypeDef *p_config,
                                            uint32_t size_array);

/* PLAY Configuration unitary functions for Input *****************************/
HAL_StatusTypeDef HAL_PLAY_INPUT_SetSource(const HAL_PLAY_HandleTypeDef *hplay, HAL_PLAY_IN_SourceTypeDef source);
HAL_PLAY_IN_SourceTypeDef HAL_PLAY_INPUT_GetSource(const HAL_PLAY_HandleTypeDef *hplay, HAL_PLAY_INTypeDef mux_id);
HAL_StatusTypeDef HAL_PLAY_INPUT_SetMinPulseWidth(const HAL_PLAY_HandleTypeDef *hplay, HAL_PLAY_INTypeDef mux_id,
                                                  uint32_t width);
uint32_t HAL_PLAY_INPUT_GetMinPulseWidth(const HAL_PLAY_HandleTypeDef *hplay, HAL_PLAY_INTypeDef mux_id);
HAL_StatusTypeDef HAL_PLAY_INPUT_SetEdgeDetectionMode(const HAL_PLAY_HandleTypeDef *hplay, HAL_PLAY_INTypeDef mux_id,
                                                      HAL_PLAY_EdgeDetectionModeTypeDef mode);
HAL_PLAY_EdgeDetectionModeTypeDef HAL_PLAY_INPUT_GetEdgeDetectionMode(const HAL_PLAY_HandleTypeDef *hplay,
                                                                      HAL_PLAY_INTypeDef mux_id);

/* PLAY Configuration unitary functions for Lookup table *********************/
HAL_StatusTypeDef HAL_PLAY_LUT_SetTruthTable(const HAL_PLAY_HandleTypeDef *hplay, HAL_PLAY_LUTTypeDef lut,
                                             uint32_t truth_table_value);
uint32_t HAL_PLAY_LUT_GetTruthTable(const HAL_PLAY_HandleTypeDef *hplay, HAL_PLAY_LUTTypeDef lut);
HAL_StatusTypeDef HAL_PLAY_LUT_SetSource(const HAL_PLAY_HandleTypeDef *hplay, HAL_PLAY_LUTTypeDef lut,
                                         HAL_PLAY_LUT_InputTypeDef lut_input,
                                         HAL_PLAY_LUT_InputSourceTypeDef source);
HAL_PLAY_LUT_InputSourceTypeDef HAL_PLAY_LUT_GetSource(const HAL_PLAY_HandleTypeDef *hplay, HAL_PLAY_LUTTypeDef lut,
                                                       HAL_PLAY_LUT_InputTypeDef lut_input);
HAL_StatusTypeDef HAL_PLAY_LUT_SetClockGateSource(const HAL_PLAY_HandleTypeDef *hplay, HAL_PLAY_LUTTypeDef lut,
                                                  HAL_PLAY_LUT_ClkGateSourceTypeDef source);
HAL_PLAY_LUT_ClkGateSourceTypeDef HAL_PLAY_LUT_GetClockGateSource(const HAL_PLAY_HandleTypeDef *hplay,
                                                                  HAL_PLAY_LUTTypeDef lut_id);

/* PLAY Configuration unitary functions for Output ****************************/
HAL_StatusTypeDef HAL_PLAY_OUTPUT_SetSource(const HAL_PLAY_HandleTypeDef *hplay, HAL_PLAY_OUTTypeDef mux_id,
                                            uint32_t source);
uint32_t HAL_PLAY_OUTPUT_GetSource(const HAL_PLAY_HandleTypeDef *hplay, HAL_PLAY_OUTTypeDef mux_id);

/**
  * @}
  */

/** @defgroup PLAY_Exported_Functions_Group3  Peripheral control functions
  * @{
  */

HAL_StatusTypeDef HAL_PLAY_Start(HAL_PLAY_HandleTypeDef *hplay, const HAL_PLAY_EdgeTriggerConfTypeDef *p_config);
HAL_StatusTypeDef HAL_PLAY_Stop(HAL_PLAY_HandleTypeDef *hplay);

/**
  * @}
  */

/** @defgroup PLAY_Exported_Functions_Group4  Interrupts and Edge Trigger control functions
  * @{
  */

/* PLAY APIs to manage Edge Trigger Transition of each LUT Output during the runtime */
HAL_StatusTypeDef HAL_PLAY_LUT_SetEdgeTrigger(HAL_PLAY_HandleTypeDef *hplay,
                                              const HAL_PLAY_EdgeTriggerConfTypeDef *p_config,
                                              uint32_t timeout_ms);
HAL_StatusTypeDef HAL_PLAY_LUT_SetEdgeTrigger_IT(HAL_PLAY_HandleTypeDef *hplay,
                                                 const HAL_PLAY_EdgeTriggerConfTypeDef *p_config);
HAL_StatusTypeDef HAL_PLAY_LUT_GetEdgeTrigger(HAL_PLAY_HandleTypeDef *hplay, HAL_PLAY_EdgeTriggerConfTypeDef *p_config);

