zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/include/stm32h5xx_hal_play.h
HAL_StatusTypeDef HAL_PLAY_LUT_PollForEdgeTrigger(HAL_PLAY_HandleTypeDef *hplay,
                                                  HAL_PLAY_PollingEdgeTriggerTypeDef poll_mode,
                                                  uint32_t edge_trig_mask, uint32_t *p_edge_trig_mask_status,
                                                  uint32_t timeout_ms);

/* PLAY APIs to manage interrupts on lookup table output */
HAL_StatusTypeDef HAL_PLAY_LUT_EnableIT(const HAL_PLAY_HandleTypeDef *hplay, uint32_t its_mask);
HAL_StatusTypeDef HAL_PLAY_LUT_DisableIT(const HAL_PLAY_HandleTypeDef *hplay, uint32_t its_mask);
uint32_t HAL_PLAY_LUT_GetIT(const HAL_PLAY_HandleTypeDef *hplay);

/**
  * @}
  */

/** @defgroup PLAY_Exported_Functions_Group5  Software Trigger control functions
  * @{
  */

HAL_StatusTypeDef HAL_PLAY_WriteSWTrigger(const HAL_PLAY_HandleTypeDef *hplay, uint32_t sw_triggers,
                                          HAL_PLAY_SWTriggerStateTypeDef state, uint32_t timeout_ms);
HAL_StatusTypeDef HAL_PLAY_WriteSWTrigger_IT(const HAL_PLAY_HandleTypeDef *hplay, uint32_t sw_triggers,
                                             HAL_PLAY_SWTriggerStateTypeDef state);
HAL_StatusTypeDef HAL_PLAY_ToggleSWTrigger(const HAL_PLAY_HandleTypeDef *hplay, uint32_t sw_triggers,
                                           uint32_t timeout_ms);
HAL_StatusTypeDef HAL_PLAY_ToggleSWTrigger_IT(const HAL_PLAY_HandleTypeDef *hplay, uint32_t sw_triggers);
HAL_PLAY_SWTriggerStateTypeDef HAL_PLAY_ReadSWTrigger(const HAL_PLAY_HandleTypeDef *hplay, uint32_t sw_trig);

/**
  * @}
  */

/** @defgroup PLAY_Exported_Functions_Group6  IRQ Handler and callbacks functions
  * @{
  */

void HAL_PLAY_IRQHandler(HAL_PLAY_HandleTypeDef *hplay);

void HAL_PLAY_SWTriggerWriteCpltCallback(HAL_PLAY_HandleTypeDef *hplay);
void HAL_PLAY_EdgeTriggerWriteCpltCallback(HAL_PLAY_HandleTypeDef *hplay);
void HAL_PLAY_LUTOutputRisingCallback(HAL_PLAY_HandleTypeDef *hplay, uint32_t edge_trig_mask_status);
void HAL_PLAY_LUTOutputFallingCallback(HAL_PLAY_HandleTypeDef *hplay, uint32_t edge_trig_mask_status);

#if (USE_HAL_PLAY_REGISTER_CALLBACKS == 1)
/* Callbacks Register/UnRegister functions ************************************/
HAL_StatusTypeDef HAL_PLAY_RegisterCallback(HAL_PLAY_HandleTypeDef *hplay, HAL_PLAY_CallbackIDTypeDef CallbackID,
                                            pPLAY_CallbackTypeDef pCallback);
HAL_StatusTypeDef HAL_PLAY_RegisterLUTOutputCallback(HAL_PLAY_HandleTypeDef *hplay,
                                                     HAL_PLAY_CallbackIDTypeDef CallbackID,
                                                     pPLAY_LUTOutputCallbackTypeDef pCallback);
HAL_StatusTypeDef HAL_PLAY_UnRegisterCallback(HAL_PLAY_HandleTypeDef *hplay, HAL_PLAY_CallbackIDTypeDef CallbackID);
HAL_StatusTypeDef HAL_PLAY_UnRegisterLUTOutputCallback(HAL_PLAY_HandleTypeDef *hplay,
                                                       HAL_PLAY_CallbackIDTypeDef CallbackID);

#endif /* USE_HAL_PLAY_REGISTER_CALLBACKS */
/**
  * @}
  */

/** @defgroup PLAY_Exported_Functions_Group7  Handle control functions
  * @{
  */

HAL_PLAY_StateTypeDef HAL_PLAY_GetState(const HAL_PLAY_HandleTypeDef *hplay);
uint32_t HAL_PLAY_GetError(const HAL_PLAY_HandleTypeDef *hplay);

/**
  * @}
  */

/** @defgroup PLAY_Exported_Functions_Group8  Security and privileged access levels attributes management
  * @{
  */

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
HAL_StatusTypeDef HAL_PLAY_SetSecAttr(const HAL_PLAY_HandleTypeDef *hplay, uint32_t item,
                                      HAL_PLAY_SecAttrTypeDef sec_attr);
#endif /* __ARM_FEATURE_CMSE */
HAL_PLAY_SecAttrTypeDef HAL_PLAY_GetSecAttr(const HAL_PLAY_HandleTypeDef *hplay, uint32_t item);

HAL_StatusTypeDef HAL_PLAY_SetPrivAttr(const HAL_PLAY_HandleTypeDef *hplay, uint32_t item,
                                       HAL_PLAY_PrivAttrTypeDef priv_attr);
HAL_PLAY_PrivAttrTypeDef HAL_PLAY_GetPrivAttr(const HAL_PLAY_HandleTypeDef *hplay, uint32_t item);

/**
  * @}
  */

/**
  * @}
  */

#endif /* PLAY1 */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* STM32H5xx_HAL_PLAY_H */
